#include <iostream>

using namespace std;

int main() {

    ios_base::sync_with_stdio(0);
    cin.tie(0);
    cout.tie(0);

    // 1. 포인터



    cout << "-------------------------------------------\n              1. 포인터\n-------------------------------------------\n\n";

    int a[] = { 10,20,30,40,50 };

    cout << "배열 a[0]의 주소값 = " << a << "\n";
    cout << "배열 a[1]의 주소값 = " << a + 1 << "\n";
    cout << "배열 a[0]의 값 = " << *a << "\n";
    cout << "배열 a[1]의 값 = " << *(a + 1) << "\n\n";

    int b = 10;
    int* pa = &b;

    // 2. 포인터 연산자

    cout << "-------------------------------------------\n              2. 포인터 연산자\n-------------------------------------------\n\n";

    cout << "b의 값 : " << b << "\n";
    cout << "pa의 값 : " << pa << "\n";
    // 주소 연산자& 는 변수 이름 앞에 사용하여 해당 변수의 메모리 주소 값을 반환한다.
    cout << "주소연산자 결과 : " << &b << "\n";
    // 참조 연산자* 는 포인터의 이름이나 주소 앞에 사용하며  해당 주소를 참조하여 주소에 저장되어 있는 값을 반환한다.
    cout << "참조연산자 결과 : " << *pa << "\n";
    cout << "주소연산자와 참조연산자 동시사용 결과 : " << *&b << "\n\n";

    // 3. 이중포인터

    cout << "-------------------------------------------\n              3. 이중포인터\n-------------------------------------------\n\n";

    int p = 10;
    int* pt = &p;
    int** ppt = &pt;

    cout << "p의 값 : " << p << "\n";
    cout << "&p의 값 : " << &p << "\n";
    cout << "pt의 값 : " << pt << "\n";
    cout << "*pt의 값 : " << *pt << "\n";
    cout << "&pt의 값 : " << &pt << "\n";
    cout << "ppt의 값 : " << ppt << "\n";
    cout << "&ppt의 값 : " << &ppt << "\n";
    cout << "*ppt의 값 : " << *ppt << "\n";
    cout << "**ppt의 값 : " << **ppt << "\n\n"; // 2번 참조하여 p의 값이 나옴

    /* 즉, **ppt=>*(*ppt) => *(pt의 주소) => p의 값으로 이해하면 된다. */

    // 4. 포인터 연산

    cout << "-------------------------------------------\n              4. 포인터 연산\n-------------------------------------------\n\n";

    int c = 1;
    int* pc = &c;

    double d = 0.1;
    double* pd = &d;

    cout << "pc의 값 : " << pc << "\n";
    cout << "pc + 1의 값 : " << pc + 1 << "\n";
    cout << "pd의 값 : " << pd << "\n";
    cout << "pd + 1의 값 : " << pd + 1 << "\n\n";

    // 5. 포인터와 배열

    cout << "-------------------------------------------\n              5. 포인터 배열\n-------------------------------------------\n\n";

    int arr[3] = { 10,20,30 };
    int* pt_arr = arr;

    cout << "배열 이름으로 배열의 요소 출력 : " << arr[0] << " " << arr[1] << " " << arr[2] << "\n";
    cout << "포인터로 배열의 요소 출력 : " << pt_arr[0] << " " << pt_arr[1] << " " << pt_arr[2] << "\n";
    cout << "배열을 포인터처럼 요소 출력 : " << *(arr) << " " << *(arr + 1) << " " << *(arr + 2) << "\n";

    return 0;
}